/*程序7-3：*/
#define M 13     /*M为表长*/
struct hterm
{
    int key;     /*结点关键字域*/
                 /*若有其他数据,继续定义,这里假设只有key域*/
};

int linsearch(r,ht)       /*线性探查*/
int r;                    /*r为待查记录*/
struct hterm ht[M];       /*ht为散列表*/
{   int i;
    i=r%13;               /*计算r记录的散列地址,假设H(key)=key%13*/
    while((ht[i].key!=0)&&(ht[i].key!=r)) /*0表示存储空间是开放的*/
        i=(i+1)%13;            /*探测下一次,%为取余运算*/
    if(ht[i].key==0)
        ht[i].key=r;           /*查找不成功时插入该记录*/
    return(i);
}

main()                         /*主程序*/
{   int i,j;
    struct hterm ht[M];
    for(i=0;i<13;i++)          /*为关键字字段赋初值0，表示存储空间是开放的*/
        ht[i].key=0;
    printf("\n请输入五个待查找记录 : ");
    for(i=0;i<5;i++)
    {
        scanf("%d",&j);        /*输入五个待查找记录*/
        linsearch(j,ht);       /*调用查找函数*/
    }
    printf("输出散列表 ：");
    for(i=0;i<13;i++)          /*输出结果*/
    {
        printf("%d,",ht[i].key);
    }
}
程序第一次运行结果：
请输入五个待查找记录 : 19 33 32 12 18（回车）
输出散列表 ：0,0,0,0,0,18,19,33,32,0,0,0,12, 
程序第二次运行结果：
请输入五个待查找记录 : 19 19 19 19 19（回车）
输出散列表 ：0,0,0,0,0,0,19,0,0,0,0,0,0,   