main()
{
   int r[10]={45,38,63,85,71,17,28,45,6,90};   /*定义数组并赋初值*/
   int d,i,j,k,x;
   d=10/2;                                        /*取第一个步长值*/
   while(d>=1)                   /*步长d>=1,对各组进行直接插入排序*/
   { 
      for(i=d;i<10;i++)                   /*对每组进行直接插入排序*/
      {
         x=r[i];                               /*记录r[i]暂存入x中*/
         j=i-d;                   /*确定每组中的记录r[i]前一个位置*/
         while(j>=0&&x<r[j])                  /*在组中查找插入位置*/
         {
            r[j+d]=r[j];                                /*记录后移*/
            j=j-d;                          /*记录位置前移一个步长*/
         }
         r[j+d]=x;                                      /*插入记录*/
      }
      d=d/2;                             /*缩小步长值,取下一步长值*/
   } 
   for(k=0;k<10;k++)
      printf("%d ",r[k]);                   /*输出排序后的有序序列*/
}
程序运行结果：
6 17 28 38 45 45 63 71 85 90
