main()
{
    int i,j;
    int r[9]={0,42,36,56,78,67,11,27,36}; /*定义数组并赋初值,其中r[0]为监视哨,初值为0*/
    for(i=2;i<=8;++i)                     /*第一个数是有序的,为初始有序序列,i从2开始*/
        if(r[i]<r[i-1])                   /*如"<",需将r[i]插入到前面有序序列中*/
        {                                 /*否则r[i]不需要插入,保持原来位置*/
            r[0]=r[i];                    /*r[i]的值放入监视哨中*/
            for(j=i-1;r[0]<r[j];--j)
                r[j+1]=r[j];              /*记录后移*/
            r[j+1]=r[0];                  /*插入到正确位置*/
        }
    for(i=1;i<=8;i++)
        printf("%d ",r[i]);               /*输出排序后的数组元素*/
}
程序运行结果:
11 27 36 36 42 56 67 78
