main()
{
   int i,j,low,high,m;                   /*low,high,m表示查找的上下界和中间位置*/
   int r[9]={0,42,36,56,78,67,11,27,36}; /*定义数组并初始化*/
   for(i=2;i<=8;++i)                     /*r[1]是有序的,从r[2]开始排序*/
   {
      r[0]=r[i];                         /*将r[i]暂时存到r[0]*/
      low=1;
      high=i-1;                          /*置有序序列区间的初值*/
      while(low<=high)                   /*在r[low]到r[high]中折半查找插入位置*/
      {
         m=(low+high)/2;                 /*折半,取中间位置送m*/
         if(r[0]<r[m])
            high=m-1;                    /*插入位置在低半区*/
         else
            low=m+1;                     /*插入位置在高半区*/
      }
      for(j=i-1;j>=high+1;--j)
         r[j+1]=r[j];                    /*插入位置以后的记录后移*/
         r[high+1]=r[0];                 /*插入记录*/
   }
   for(i=1;i<=8;i++) 
      printf("%d ",r[i]);                /*输出排序后的有序序列*/
}
程序运行结果：
11 27 36 36 42 56 67 78 
 
